# Ваша програма повинна вміти розділяти один список на два та помістити їх у
# новий список. Тобто, в результаті повинен вийти список із 2-х списків.
# Якщо в початковому списку непарна кількість елементів, то в першому списку
# має бути більше елементів. Якщо у списку немає елементів, то має бути
# створений список із двома порожніми списками. Важливо! Потрібно створити
# рішення, яке обробляє 3 випадки - список порожній, у списку парна кількість
# елементів і в списку непарна кількість елементів.
#
# Приклади:
# Було => стало
# [1, 2, 3, 4, 5, 6] => [[1, 2, 3], [4, 5, 6]]
# [1, 2, 3] => [[1, 2], [3]]
# [1, 2, 3, 4, 5] => [[1, 2, 3], [4, 5]]
# [1] => [[1], []]
# [] => [[], []]

# Для перевірки коректності роботи Вашого коду використовуйте приклади вище.
# Робити запит на введення даних від користувача не потрібно.

list1 = []
list2 = [1, 2, 3, 4, 5, 6]
list3 = [1, 2, 3]
list4 = [1, 2, 3, 4, 5]
list5 = [1]

half_list1 = (len(list1) + 1) // 2
half1 = list1[:half_list1]
half2 = list1[half_list1:]
new_list1 = [half1, half2]
print(new_list1)

half_list2 = (len(list2) + 1) // 2
half1 = list2[:half_list2]
half2 = list2[half_list2:]
new_list2 = [half1, half2]
print(new_list2)

half_list3 = (len(list3) + 1) // 2
half1 = list3[:half_list3]
half2 = list3[half_list3:]
new_list3 = [half1, half2]
print(new_list3)

half_list4 = (len(list4) + 1) // 2
half1 = list4[:half_list4]
half2 = list4[half_list4:]
new_list4 = [half1, half2]
print(new_list4)

half_list5 = (len(list5) + 1) // 2
half1 = list5[:half_list5]
half2 = list5[half_list5:]
new_list5 = [half1, half2]
print(new_list5)
